def get_default_keyboard():
    return {
        "one_time": False,
        "buttons": [
            [
                {
                    "action": {
                        "type": "text",
                        # "payload": "{\"button\": \"1\"}",
                        "label": "Погода"
                    },
                    "color": "primary"
                },
                {
                    "action": {
                        "type": "text",
                        # "payload": "{\"button\": \"2\"}",
                        "label": "Помощь"
                    },
                    "color": "primary"
                }
            ],
            [
                {
                    "action": {
                        "type": "text",
                        # "payload": "{\"button\": \"2\"}",
                        "label": "Синички 0"
                    },
                    "color": "primary"
                },
                {
                    "action": {
                        "type": "text",
                        # "payload": "{\"button\": \"2\"}",
                        "label": "Синички 20"
                    },
                    "color": "primary"
                },
                {
                    "action": {
                        "type": "text",
                        # "payload": "{\"button\": \"2\"}",
                        "label": "Синички 100"
                    },
                    "color": "primary"
                }
            ],
            [
                {
                    "action": {
                        "type": "text",
                        # "payload": "{\"button\": \"2\"}",
                        "label": "Старт"
                    },
                    "color": "positive"
                },
                {
                    "action": {
                        "type": "text",
                        # "payload": "{\"button\": \"2\"}",
                        "label": "Стоп"
                    },
                    "color": "negative"
                },
                {
                    "action": {
                        "type": "text",
                        # "payload": "{\"button\": \"2\"}",
                        "label": "Старт синички"
                    },
                    "color": "positive"
                },
                {
                    "action": {
                        "type": "text",
                        # "payload": "{\"button\": \"2\"}",
                        "label": "Стоп синички"
                    },
                    "color": "negative"
                }
            ],
            [
                {
                    "action": {
                        "type": "text",
                        "label": "Скрыть"
                    },
                    "color": "secondary"
                }
            ],
        ]
    }


def get_admin_keyboard():
    return {
        "one_time": False,
        "buttons": [
            [
                {
                    "action": {
                        "type": "text",
                        # "payload": "{\"button\": \"1\"}",
                        "label": "Погода"
                    },
                    "color": "primary"
                },
                {
                    "action": {
                        "type": "text",
                        # "payload": "{\"button\": \"2\"}",
                        "label": "Помощь"
                    },
                    "color": "primary"
                }
            ],
            [
                {
                    "action": {
                        "type": "text",
                        # "payload": "{\"button\": \"1\"}",
                        "label": "Синички 0"
                    },
                    "color": "primary"
                },
                {
                    "action": {
                        "type": "text",
                        # "payload": "{\"button\": \"2\"}",
                        "label": "Синички 20"
                    },
                    "color": "primary"
                },
                {
                    "action": {
                        "type": "text",
                        # "payload": "{\"button\": \"2\"}",
                        "label": "Синички 100"
                    },
                    "color": "primary"
                }
            ],
            [
                {
                    "action": {
                        "type": "text",
                        "label": "Скрыть"
                    },
                    "color": "secondary"
                }
            ],
        ]
    }


def get_help_text():
    return \
        "̲С̲т̲р̲и̲м - ссылка на стрим\n" \
        "̲Г̲д̲е N(N - имя человека) - информация о чекточках\n" \
        "̲С̲и̲н̲и̲ч̲к̲и [N[,M]](N - количество кадров в гифке, 20 дефолт, M - качество(0 или 1), 0 дефолт) - ссылка, снапшот и гифка\n" \
        "̲Р̲е̲г - регистрация для участия в петровиче дня\n" \
        "̲П̲е̲т̲р̲о̲в̲и̲ч̲ ̲д̲н̲я - мини-игра, определяющая кто Петрович Дня\n" \
        "̲С̲т̲а̲т̲а - статистика по Петровичам\n" \
        "̲Д̲а̲н̲е̲т - бот вернёт да или нет. Можно просто \"?\" или в конце указать \"?\"\n" \
        "̲Р̲а̲н̲д̲о̲м N[,M] (N,M - от и до) - рандомное число в заданном диапазоне\n" \
        "̲П̲о̲г̲о̲д̲а [N] (N - название города(Самара, Питер, Сызрань, Прибой)) - погода в городе\n" \
        "̲О̲б̲о̲с̲р̲а̲т̲ь [N] - рандомное оскорбление. N - что/кто либо\n" \
        "̲Ц̲и̲т̲а̲т̲а + пересылаемое сообщение - сохраняет в цитатник сообщение(я)\n" \
        "̲Ц̲и̲т̲а̲т̲ы [N[,M]]- просмотр сохранённых цитат. Возможные комбинации - N - номер страницы, N - фраза для поиска, N - фраза для поиска, M - номер страницы\n" \
        "Клава/скрыть - показывает/убирает клавиатуру\n" \
        "̲П̲о̲м̲о̲щ̲ь - помощь\n" \
        "\n-- команды для группы 6221 --\n" \
        "̲Р̲а̲с̲п̲и̲с̲а̲н̲и̲е - картинка с расписанием\n" \
        "̲У̲ч̲е̲б̲н̲о̲е - ссылка на папку с учебным материалом\n" \
        "̲Л̲е̲к̲ц̲и̲и - ссылка на папку с моими лекциями\n" \
        "̲Н̲е̲д̲е̲л̲я - номер текущей учебной недели\n" \
        "\n--для администраторов--\n" \
        "̲У̲п̲р̲а̲в̲л̲е̲н̲и̲е (N,M) - N - chat_id, M - сообщение [Только для администраторов]\n" \
        "̲С̲т̲р̲и̲м [N] (N - ссылка на стрим) \n" \
        "̲С̲т̲а̲р̲т/̲С̲т̲о̲п [N]- возобновляет/продолжает работу бота. С параметром можно отключить нужный модуль\n"


def get_insults():
    return ["Алик", "Алкаш", "алконавт", "Аллаяр", "Альтернативно одаренный", "Амаус", "Аморал",
            "аморальный", "Антихрист", "Аптряй", "Архаровец", "Аспид", "Ащеул", "Баба", "Баба ветрогонка",
            "Бабашкин", "Бабинский", "Бабуин", "Баклан", "Балабол", "Баламошка", "Баламут", "Балахвостъ",
            "Балахрыска", "Балбес", "Балда", "Балдабей", "Баляба", "Бандит", "Банный лист", "Баран",
            "Бармаглот", "Барнабаш", "Барыга", "Басалай", "Басурманин", "Башибузук", "Без царя в голове",
            "Бездарь", "Бездельник", "Безмозглая курица", "Безобразник", "Безпелюха", "Безсоромна баба",
            "Белебеня", "Бесстыдник", "Бестия", "Бестолочь", "Бесшабашный", "Бзыря", "Блаженный", "Блудоумъ",
            "Блудяшка", "Бобыня", "Божевольный", "Божедурье", "Болван", "Болдырь", "Болтун", "Боров",
            "Босяк", "Ботаник", "Брандахлыст", "Бредкий", "Брехло", "Брехун", "Брыдлый", "Буня", "Буслай",
            "Быдло", "Бычара", "Бычьё", "Бяка", "В попу укушенный", "Валандай", "Вася  Бардуль", "Вахлай",
            "Ведьма", "Веред", "Верзила", "Вертопрахъ", "Вертухай", "Вешалка", "Визгопряха", "Висельник",
            "Вобла сушеная ", "Волк позорный", "Волки позорные", "Волочайка", "Волчара", "Волчья сыть",
            "Вонючка", "Ворона ловить", "Ворюга", "Вошь на гребешке", "Вшивота", "Вымесок", "выпивоха",
            "Выпороток", "Выродок", "Вяжихвостка", "Гадина", "Гамадрил", "Гамыра", "Гандон", "Гвозди",
            "Геморрой", "Гиена кладбищенская", "Глазопялка", "Глиста", "Глиста ходячая", "Глуподырый",
            "Гнида", "Гноище", "Гнус", "Гнусь", "Говна лопата", "Говно", "Говноед", "Голиаф",
            "Голова садовая", "Головешка с мозгами", "Головка от патефона", "Головорез", "Голь перекатная",
            "Гомик", "Гондурас", "Гонщик", "Гопник", "Гопота", "Горилла", "Горлопан", "Грабастикъ",
            "Грубиян", "Грымза", "Губошлёп", "Гузыня", "Гульня", "Гусыня", "Гусь", "Дармоед", "Дать в репу",
            "Даун", "Дебил", "Дегенерат", "Декадент", "Демон", "Дерево", "Держиморда", "Дерьмо", "Дистрофик",
            "Дитка", "Долбень", "Долботряс", "Дрищь", "Дрянь", "Дуб", "Дубина", "Дубина стоеросовая",
            "Дуботолкъ", "Дундук", "Дунька", "Дупель", "Дурак", "Дуралей", "дурачок", "Дурбалай",
            "Дурбецелло", "Дурень", "Дурилка", "Дурка", "Дуропляс", "Дурошлеп", "Дурында", "Душман",
            "Душной козел", "Дятел", "Егоза", "Едрён батон", "Ёжкин", "Ёкарный бабай", "Елдыга", "Ёлупень",
            "Ёнда", "Ёра", "Ерондер пуп", "Еропка", "Ерохвостъ", "Ерпыль", "Ершится", "Етишкин дух", "Жаба",
            "Жадина", "Желчный", "Жердяй", "Жертва аборта", "Живоглот", "Живодристик", "Жиздоръ", "Жила",
            "Жиртрест", "Жлоб", "Жмот", "Жополиз", "Жук", "Жук навозный", "Жулик", "Жупел", "забулдыга",
            "Загузастка", "Задница", "Задор", "Задрот", "Задрыга", "Залупа", "заморыш", "Замухрышка",
            "зануда", "Заовинник", "Зараза", "засранец", "Засыха", "Затетёха", "Захухря", "заячий хвост",
            "Звери", "Зверь", "Злодей", "Злотвор", "Злыдень", "Змеиная рвота", "Змея", "зубоскал",
            "Ибтую мэмэ", "Идиот", "Изверг", "Извращенец", "Изувер", "Имбецил", "Индюк", "Ирод", "Иуда",
            "Ишак", "Кабан", "Каботин", "Кабыздох", "Каин", "Какашка", "Каланча", "Каналья", "Каракатица",
            "Карга", "Кацап", "Кащей", "Квазимодо", "Кикимора", "Киселяй", "Клоп", "Клубничка", "Клуша",
            "Клюшка", "Кляузник", "Кобель", "Кобыла", "Козёл", "Козлодой", "Козлодорасина", "Козья морда",
            "Козявка", "Колдырь", "Колобродъ", "Коломесъ", "Колотовка", "Колупай", "Конь педальный",
            "Копрофаг", "Копрофил", "Корова", "Королобый", "Корявый", "Косорукий", "Костеря", "Кочерыжка",
            "Кошёлка", "Кощей", "Кракозяблик", "Краля", "Крамольник", "Кретин", "Кривляка", "Криволапый",
            "Кровопийца", "Кровосос", "Кропотъ", "Крохобор", "Крыса", "Кугут", "Куёлда", "Курва", "Куркуль",
            "Курощупъ", "Кучка на ровном месте", "Кю", "Лапотник", "лахудра", "Ледаша детина", "Лежака",
            "Леший", "Липовый диплом", "Лободырный", "ложкомойка", "лопух", "лох", "Лох,лохушка", "Лоха",
            "Лоший", "Лудъ", "Любомудръ", "Лябзя", "Лярва", "Макака", "Малахольный", "Мамошка", "Мандавошка",
            "Мандуда", "Маракуша", "Маромойка", "Мартышка", "Массаракш", "Мастдай однобитный", "Межеумокъ",
            "Мент", "Мерзавец", "Мерзопакость", "Метёлка", "Михрютка", "Младоуменъ суще", "Мозгляк",
            "Мокрица", "Мокрощёлка", "Моль", "Монстр", "Морда", "Мордоворот", "Мордофиля", "Моркотникъ",
            "Москолудъ", "Моська", "Мочалка", "Мразь", "Мракобес", "Мудак", "Мурло", "мусор", "Муфлон",
            "Мухоблудъ", "Мымра", "Наглец", "Назойливая муха", "Напыщенный индюк", "Насупа", "Насупоня",
            "Нахал", "Невегласъ", "Невежа", "Невежда", "Негодяй", "Негораздокъ", "Недоносок", "Недотёпа",
            "Недотепа", "Недотыкомка", "Недоумок", "Неповоротень", "Непотопляемый", "Несмыселъ", "Нетопырь",
            "Нефырь", "Нехристь", "Нечисть", "Ничтожество", "Обалдуй", "Обдувало", "Обезьяна", "облезлый",
            "Обломъ", "Облудъ", "Оболдуй", "Оболтус", "Обормот", "Образина", "Овца", "Оглоед", "Огуряла",
            "Одоробло", "Озорник", "Окаёмъ", "Окаянный", "Околотень", "Олень", "Олигофрен", "Олух",
            "Олух царя небесного", "омерзительный", "Опущ", "Орангутан", "Осёл", "Осиновый лист",
            "Остолбень", "Остолоп", "Отморозок", "Отстой", "Отымалка", "Охальникъ", "Охламон", "Очкарик",
            "Павлин", "Пакостник", "паразит", "Паршивец", "паскуда", "Пеньтюхъ", "Пердимонокль", "Пердун",
            "пересмешник", "Пес", "петух", "Пехтюкъ", "Печегнётъ", "Печная ездова", "пигалица", "Пидор",
            "Пижон", "Плеха", "Поганец", "Поганка", "Погань", "Подлец", "подонок", "пожиратель гравия",
            "Позорный", "попа", "Попа с ручкой", "Попрешница", "Потаскуха", "Потатуй", "Похабникъ",
            "Пресноплюй", "придурок", "Приставучий репей", "пройдоха", "Проказник", "проныра", "пропойца",
            "простак", "простофиля", "Профура", "профурсетка", "прохвост", "прохиндей", "Прошмандовка",
            "прощелыга", "Псоватый", "Пустобрёхъ", "Пустошный", "Пыня", "Пьявка", "пьянь ", "Пятигузъ",
            "Развисляй", "разгильдяй", "Разделать под орех", "раздолбай", "Раззява", "разиня", "Разлямзя",
            "размазня", "Разноголовый", "Разтетёха", "Растопча", "растыка", "растяпа", "Расшивоха",
            "Расщеколда", "Рахубникъ", "Рвань", "Рогоносец", "рожа", "рохля", "рыло", "Рюма", "сатрап",
            "Свербигузка", "Свинья", "Сволочь", "Сдёргоумка", "Сексот", "Секушка", "Сиволапъ", "Сивый мерин",
            "Скапыжный", "Скаредъ", "Сквернавецъ", "Скоблёное рыло", "Скряга", "смерд", "Сняголовь",
            "Солдафон", "Стеллерова газель", "Стерва", "Стервец", "Стиляга", "Страмецъ", "Страхолюдъ",
            "Стукач", "Суемудръ", "сукин сын", "Супостат", "Сыч", "Та ещё жучка", "Тартыга", "Тварь",
            "Телеухъ", "тетёха", "Тетёшка", "Титёшница", "тля", "Толоконный лобъ", "тормоз", "трепло",
            "Трупёрда", "Трутень", "трынделка", "Трясся", "Туесъ", "Тупица", "тупой", "Тьмонеистовый",
            "Тюрюхайло", "тюфяк", "Ублюдок", "Убожество", "Угланъ", "Удод", "Упырь", "Урка", "Урод", "Урюк",
            "Урюпа", "Ушлёпок", "Фетюк", "Фигляр", "Филькина грамота", "Фифа", "Фофан", "Фраер", "Фуфло",
            "Фуфлыга", "хабалка", "Хабалъ", "халдей", "Халтома", "Халявщик", "Хам", "Хана", "Хандрыга",
            "ханыга", "хапуга", "Харя", "Хмырь", "Хмыстень", "Хобяка", "ходячее кладбище бифштексов",
            "холера", "холуй", "Хорёк ", "Хохрикъ", "Хуже горькой редьки", "Цуцик", "Чёрт",
            "Чёртъ верёвочный", "Чувырла", "Чужеядъ", "Чучело", "Шаврикъ", "Шалава", "шалопут", "Шалопутъ",
            "Шантрапа", "Шаромыжник", "Шваль", "Шевяк", "шельма", "Шибздик", "Шизик", "Шинора", "Шкура",
            "Шлында", "Шлюха", "Шмакодявка", "Шмара", "Шмаровоз", "Шпана", "Шпынь голова", "Шут гороховый",
            "Шушера", "Щаул", "Щегол", "Щенок", "Юродивый", "Я", "Ябеда", "Язва", "Яйцеголовый",
            "Яйцекладущий сын замороженного пня", "Японский городовой", "Ятидрёный хряп",
            "Ублюдок, мать твою, а ну иди сюда говно собачье, решил ко мне лезть? Ты, засранец вонючий, мать твою, а? Ну иди сюда, попробуй меня трахнуть, я тебя сам трахну ублюдок, онанист чертов, будь ты проклят, иди идиот, трахать тебя и всю семью, говно собачье, жлоб вонючий, дерьмо, сука, падла, иди сюда, мерзавец, негодяй, гад, иди сюда ты - говно, ЖОПА"]
